JayHeng/imxrt-tool-flash-algo/boards/rt600_sdcard_project/flash_algo_b0_silicon/Keil_JLink/sdcard/fsl_sd.c
static status_t SD_BL_SelectBusTiming(sd_card_t *card)
{
    assert(card);

    status_t error = kStatus_SDMMC_SwitchBusTimingFailed;
    uint32_t funcTiming, freq;

    switch (card->userConfig.timing)
    {
        case kSD_TimingDDR50Mode:
            if (kSDMMCHOST_SupportDDR50 != SDMMCHOST_NOT_SUPPORT)
            {
                funcTiming = kSD_FunctionDDR50;
                freq = SD_CLOCK_100MHZ;
                break;
            }
            else
            {
                return kStatus_SDMMC_HostNotSupport;
            }
        case kSD_TimingSDR104Mode:
            if (kSDMMCHOST_SupportSDR104 != SDMMCHOST_NOT_SUPPORT)
            {
                funcTiming = kSD_FunctionSDR104;
                freq = SDMMCHOST_SUPPORT_SDR104_FREQ;
                break;
            }
            else
            {
                return kStatus_SDMMC_HostNotSupport;
            }
        case kSD_TimingSDR50Mode:
            if (kSDMMCHOST_SupportSDR50 != SDMMCHOST_NOT_SUPPORT)
            {
                funcTiming = kSD_FunctionSDR50;
                freq = SD_CLOCK_100MHZ;
                break;
            }
            else
            {
                return kStatus_SDMMC_HostNotSupport;
            }
        case kSD_TimingSDR25HighSpeedMode:
            if (kSDMMCHOST_SupportHighSpeed != SDMMCHOST_NOT_SUPPORT)
            {
                funcTiming = kSD_FunctionSDR25HighSpeed;
                freq = SD_CLOCK_50MHZ;
                break;
            }
            else
            {
                return kStatus_SDMMC_HostNotSupport;
            }
        case kSD_TimingSDR12DefaultMode:
        default:
            return kStatus_Success;
    }

    error = SD_SelectFunction(card, kSD_GroupTimingMode, funcTiming);
    if (error == kStatus_Success)
    {
        card->currentTiming = card->userConfig.timing;
        card->busClock_Hz = SDMMCHOST_SET_CARD_CLOCK(card->host.base, card->host.sourceClock_Hz, freq);
    }
    else
    {
        return kStatus_SDMMC_SwitchBusTimingFailed;
    }

    /* SDR50 and SDR104 mode need tuning */
    if ((card->currentTiming == kSD_TimingSDR50Mode) || (card->currentTiming == kSD_TimingSDR104Mode))
    {
        /* config IO strength in IOMUX*/
        if (card->currentTiming == kSD_TimingSDR50Mode)
        {
            SDMMCHOST_UPDATE_SD_IO(card->host.base, card->userConfig.busWidth, CARD_BUS_FREQ_100MHZ1,
                                   CARD_BUS_STRENGTH_7);
        }
        else
        {
            SDMMCHOST_UPDATE_SD_IO(card->host.base, card->userConfig.busWidth, CARD_BUS_FREQ_200MHZ,
                                   CARD_BUS_STRENGTH_7);
        }
        /* execute tuning */
        if (SD_ExecuteTuning(card) != kStatus_Success)
        {
            return kStatus_SDMMC_TuningFail;
        }
    }
    else
    {
        SDMMCHOST_UPDATE_SD_IO(card->host.base, card->userConfig.busWidth, CARD_BUS_FREQ_100MHZ1, CARD_BUS_STRENGTH_4);
    }

    return error;
}

static status_t SD_SetDriverStrength(sd_card_t *card, sd_driver_strength_t driverStrength)
{
    assert(card);

    status_t error;
    uint32_t strength = driverStrength;

    error = SD_SelectFunction(card, kSD_GroupDriverStrength, strength);

    return error;
}

static status_t SD_SetMaxCurrent(sd_card_t *card, sd_max_current_t maxCurrent)
{
    assert(card);

    status_t error;
    uint32_t current = maxCurrent;

    error = SD_SelectFunction(card, kSD_GroupCurrentLimit, current);

    return error;
}

static status_t SD_Read(sd_card_t *card, uint8_t *buffer, uint32_t startBlock, uint32_t blockSize, uint32_t blockCount)
{
    assert(card);
    assert(buffer);
    assert(blockCount);
    assert(blockSize);
    assert(blockSize == FSL_SDMMC_DEFAULT_BLOCK_SIZE);

    SDMMCHOST_TRANSFER content = { 0 };
    SDMMCHOST_COMMAND command = { 0 };
    SDMMCHOST_DATA data = { 0 };
    status_t error;

    if (((card->flags & kSD_SupportHighCapacityFlag) && (blockSize != 512U)) || (blockSize > card->blockSize) ||
        (blockSize > card->host.capability.maxBlockLength) || (blockSize % 4))
    {
        return kStatus_SDMMC_CardNotSupport;
    }

    /* Wait for the card write process complete because of that card read process and write process use one buffer. */
    if (kStatus_Success != SD_WaitWriteComplete(card))
    {
        return kStatus_SDMMC_WaitWriteCompleteFailed;
    }

    data.blockSize = blockSize;
    data.blockCount = blockCount;
    data.rxData = (uint32_t *)buffer;

    command.index = kSDMMC_ReadMultipleBlock;
    if (data.blockCount == 1U)
    {
        command.index = kSDMMC_ReadSingleBlock;
    }
    command.argument = startBlock;
    if (!(card->flags & kSD_SupportHighCapacityFlag))
    {
        command.argument *= data.blockSize;
    }
    command.responseType = kCARD_ResponseTypeR1;
    command.responseErrorFlags = kSDMMC_R1ErrorAllFlag;

    content.command = &command;
    content.data = &data;

    error = SD_Transfer(card, &content, 1U);
    if (kStatus_Success != error)
    {
        return error;
    }

    /* Send STOP_TRANSMISSION command in multiple block transmission and host's AUTO_COMMAND12 isn't enabled. */
    if ((data.blockCount > 1U) && (!(data.enableAutoCommand12)))
    {
        if (kStatus_Success != SD_StopTransmission(card))
        {
            return kStatus_SDMMC_StopTransmissionFailed;
        }
    }

    return kStatus_Success;
}

static status_t SD_Write(
    sd_card_t *card, const uint8_t *buffer, uint32_t startBlock, uint32_t blockSize, uint32_t blockCount)
{
    assert(card);
    assert(buffer);
    assert(blockCount);
    assert(blockSize);
    assert(blockSize == FSL_SDMMC_DEFAULT_BLOCK_SIZE);

    SDMMCHOST_TRANSFER content = { 0 };
    SDMMCHOST_COMMAND command = { 0 };
    SDMMCHOST_DATA data = { 0 };
    status_t error;

    if (((card->flags & kSD_SupportHighCapacityFlag) && (blockSize != 512U)) || (blockSize > card->blockSize) ||
        (blockSize > card->host.capability.maxBlockLength) || (blockSize % 4U))
    {
        return kStatus_SDMMC_CardNotSupport;
    }

    /* Wait for the card's buffer to be not full to write to improve the write performance. */
    while ((GET_SDMMCHOST_STATUS(card->host.base) & CARD_DATA0_STATUS_MASK) != CARD_DATA0_NOT_BUSY)
    {
    }

