JayHeng/imxrt-tool-flash-algo/boards/rt600_sdcard_project/flash_algo_b0_silicon/Keil_JLink/sdcard/fsl_sd.c
        /* card power off */
        SDMMCHOST_SET_SD_RESET(card->host.base, card->userConfig.powerPolarity);
        /* Delay some time to make card stable. */
        SDK_DelayAtLeastUs(card->userConfig.powerDownDelay_US, SystemCoreClock);
        /* card power on */
        SDMMCHOST_SET_SD_RESET(card->host.base, !card->userConfig.powerPolarity);
        /* Delay some time to make card stable. */
        SDK_DelayAtLeastUs(card->userConfig.powerUpDelay_US, SystemCoreClock);
    }

    if (isUHSImode)
    {
        /* UHSI mode only supports 4bit. Update to 4bit mode even config 1bit. */
        card->userConfig.busWidth = kSD_DataBusWidth4Bit;
        /* init vselect pin */
        SDMMCHOST_INIT_SD_VSEL(card->host.base);
    }

    /* reset variables */
    card->flags = 0U;
    /* set DATA bus width */
    SDMMCHOST_SET_CARD_BUS_WIDTH(card->host.base, kSDMMCHOST_DATABUSWIDTH1BIT);
    /*set card freq to 300KHZ*/
    /*
     * Note: according to spec, the maximum frequency at identification state is 400KHz. But considering clock jitter,
     * and some devices might not tolerant the frequency is higher than 400KHz, 300KHz is more compatible.
     */
    card->busClock_Hz = SDMMCHOST_SET_CARD_CLOCK(card->host.base, card->host.sourceClock_Hz, SDMMC_CLOCK_300KHZ);
    /* send card active */
    SDMMCHOST_SEND_CARD_ACTIVE(card->host.base, 10000U);
    /* Get host capability. */
    GET_SDMMCHOST_CAPABILITY(card->host.base, &(card->host.capability));

    /* card go idle */
    if (kStatus_Success != SD_GoIdle(card))
    {
        return kStatus_SDMMC_GoIdleFailed;
    }

    // if (kHOST_SupportV330 != HOST_NOT_SUPPORT)
    //{
    //    applicationCommand41Argument |= (kSD_OcrVdd32_33Flag | kSD_OcrVdd33_34Flag);
    //    card->operationVoltage = kCARD_OperationVoltage330V;
    //}
    // if (kHOST_SupportV300 != HOST_NOT_SUPPORT)
    //{
    //    applicationCommand41Argument |= kSD_OcrVdd29_30Flag;
    //    card->operationVoltage = kCARD_OperationVoltage330V;
    //}
    // For bootloader, check all supplied voltage level.
    applicationCommand41Argument |=
        (kSD_OcrVdd27_28Flag | kSD_OcrVdd28_29Flag | kSD_OcrVdd29_30Flag | kSD_OcrVdd30_31Flag | kSD_OcrVdd31_32Flag |
         kSD_OcrVdd32_33Flag | kSD_OcrVdd33_34Flag | kSD_OcrVdd34_35Flag | kSD_OcrVdd35_36Flag);
    card->operationVoltage = kCARD_OperationVoltage330V;

    /* allow user select the work voltage, if not select, sdmmc will handle it automatically */
    if (kSDMMCHOST_SupportV180 != SDMMCHOST_NOT_SUPPORT)
    {
        if (isUHSImode)
        {
            applicationCommand41Argument |= kSD_OcrSwitch18RequestFlag;
        }
    }
    else
    {
        if (isUHSImode)
        {
            return kStatus_SDMMC_HostNotSupport;
        }
    }

    /* Check card's supported interface condition. */
    error = SD_BL_SendInterfaceCondition(card);
    if (kStatus_Success == error)
    {
        /* Ver2.00 or later SD card */
        applicationCommand41Argument |= kSD_OcrHostCapacitySupportFlag;
        card->flags |= kSD_SupportSdhcFlag;
    }
    else if (kStatus_SDMMC_CardNotSupport == error)
    {
        return error;
    }
    else /* No response */
    {
        /* Ver2.00 or later SD Memory Card(voltage mismatch),
         * or Ver1.X SD card, or not SD card
         */
        if (kStatus_Success != SD_GoIdle(card))
        {
            return kStatus_SDMMC_GoIdleFailed;
        }
    }
    /* Set card interface condition according to SDHC capability and card's supported interface condition. */
    if (kStatus_Success != SD_BL_ApplicationSendOperationCondition(card, applicationCommand41Argument))
    {
        return kStatus_SDMMC_HandShakeOperationConditionFailed;
    }

    /* check if card support 1.8V */
    if (card->flags & kSD_SupportVoltage180v)
    {
        if (kStatus_Success != SD_SwitchVoltage(card))
        {
            return kStatus_SDMMC_InvalidVoltage;
        }
        card->operationVoltage = kCARD_OperationVoltage180V;
    }
    else if (applicationCommand41Argument & kSD_OcrSwitch18RequestFlag)
    {
        // 1V8 is request, but not supported by SD card.
        return kStatus_SDMMC_CardNotSupport;
    }

    /* Initialize card if the card is SD card. */
    if (kStatus_Success != SD_AllSendCid(card))
    {
        return kStatus_SDMMC_AllSendCidFailed;
    }
    if (kStatus_Success != SD_SendRca(card))
    {
        return kStatus_SDMMC_SendRelativeAddressFailed;
    }
    if (kStatus_Success != SD_SendCsd(card))
    {
        return kStatus_SDMMC_SendCsdFailed;
    }
    if (kStatus_Success != SD_SelectCard(card, true))
    {
        return kStatus_SDMMC_SelectCardFailed;
    }

    /* Set to max frequency in non-high speed mode. */
    card->busClock_Hz = SDMMCHOST_SET_CARD_CLOCK(card->host.base, card->host.sourceClock_Hz, SD_CLOCK_25MHZ);

    /* Set 4 bit data bus mode. */
    if ((card->userConfig.busWidth == kSD_DataBusWidth4Bit) || isUHSImode)
    {
        if (kSDMMCHOST_Support4BitBusWidth != SDMMCHOST_NOT_SUPPORT)
        {
            /* Note: No need to check if 4bit is supported or not.
             * SPEC writes: "SD Memory Card shall support at least the two bus modes 1-bit or 4-bit width."
             */
            // if (card->flags & kSD_Support4BitWidthFlag)
            //{
            if (kStatus_Success != SD_SetDataBusWidth(card, kSD_DataBusWidth4Bit))
            {
                return kStatus_SDMMC_SetDataBusWidthFailed;
            }
            SDMMCHOST_SET_CARD_BUS_WIDTH(card->host.base, kSDMMCHOST_DATABUSWIDTH4BIT);
            //}
            // else
            //{
            //    return kStatus_SDMMC_CardNotSupport;
            //}
        }
        else
        {
            return kStatus_SDMMC_HostNotSupport;
        }
    }

    if (kStatus_Success != SD_SendScr(card))
    {
        return kStatus_SDMMC_SendScrFailed;
    }

    /* Not necessary for bootloader. */
    /* set sd card driver strength */
    // SD_SetDriverStrength(card, card->driverStrength);
    /* set sd card current limit */
    // SD_SetMaxCurrent(card, card->maxCurrent);

    /* set block size */
    if (SD_SetBlockSize(card, FSL_SDMMC_DEFAULT_BLOCK_SIZE))
    {
        return kStatus_SDMMC_SetCardBlockSizeFailed;
    }

    /* select bus timing */
    error = SD_BL_SelectBusTiming(card);
    if (error != kStatus_Success)
    {
        return error;
    }

    return kStatus_Success;
}

void SD_CardDeinit(sd_card_t *card)
{
    assert(card);

    SD_SelectCard(card, false);
}

status_t SD_HostInit(sd_card_t *card)
{
    assert(card);

    if ((!card->isHostReady) && SDMMCHOST_Init(&(card->host), (void *)(card->usrParam.cd)) != kStatus_Success)
    {
        return kStatus_Fail;
    }

    /* set the host status flag, after the card re-plug in, don't need init host again */
    card->isHostReady = true;

    return kStatus_Success;
}

void SD_HostDeinit(sd_card_t *card)
{
    assert(card);

    SDMMCHOST_Deinit(&(card->host));
    /* should re-init host */
    card->isHostReady = false;
}

